nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_shell.c
			ret = lte_lc_psm_req(true);
			if (ret < 0) {
				mosh_error("Cannot enable PSM: %d", ret);
			} else {
				mosh_print("PSM enabled");
			}
		} else if (link_cmd_args.common_option == LINK_COMMON_DISABLE) {
			ret = lte_lc_psm_req(false);
			if (ret < 0) {
				mosh_error("Cannot disable PSM: %d", ret);
			} else {
				mosh_print("PSM disabled");
			}
		} else if (link_cmd_args.common_option == LINK_COMMON_READ) {
			int tau, active_time;

			ret = lte_lc_psm_get(&tau, &active_time);
			if (ret < 0) {
				mosh_error("Cannot get PSM configs: %d", ret);
			} else {
				mosh_print(
					"PSM config: TAU %d %s, active time %d %s",
					tau,
					(tau == -1) ? "(timer deactivated)" :
					"seconds",
					active_time,
					(active_time == -1) ?
					"(timer deactivated)" :
					"seconds");
			}
		} else {
			mosh_error("Unknown option for psm command. See usage:");
			goto show_usage;
		}
		break;

	case LINK_CMD_RSRP:
		(link_cmd_args.common_option == LINK_COMMON_SUBSCRIBE) ?
		link_rsrp_subscribe(true) :
		link_rsrp_subscribe(false);
		break;
	case LINK_CMD_NCELLMEAS:
		if (link_cmd_args.common_option == LINK_COMMON_STOP) {
			link_ncellmeas_start(false, LINK_NCELLMEAS_MODE_NONE);

		} else if (link_cmd_args.ncellmeasmode != LINK_NCELLMEAS_MODE_NONE) {
			mosh_print("Neighbor cell measurements and reporting starting");
			link_ncellmeas_start(true, link_cmd_args.ncellmeasmode);
		} else {
			goto show_usage;
		}
		break;
	case LINK_CMD_MDMSLEEP:
		if (link_cmd_args.common_option == LINK_COMMON_SUBSCRIBE) {
			link_modem_sleep_notifications_subscribe(
				CONFIG_LTE_LC_MODEM_SLEEP_PRE_WARNING_TIME_MS,
				((threshold_time) ?
					 threshold_time :
					 CONFIG_LTE_LC_MODEM_SLEEP_NOTIFICATIONS_THRESHOLD_MS));
		} else {
			link_modem_sleep_notifications_unsubscribe();
		}
		break;
	case LINK_CMD_TAU:
		if (link_cmd_args.common_option == LINK_COMMON_SUBSCRIBE) {
			link_modem_tau_notifications_subscribe(
				CONFIG_LTE_LC_TAU_PRE_WARNING_TIME_MS,
				((threshold_time) ?
					 threshold_time :
					 CONFIG_LTE_LC_TAU_PRE_WARNING_THRESHOLD_MS));
		} else {
			link_modem_tau_notifications_unsubscribe();
		}
		break;
	case LINK_CMD_CONNECT: {
		struct link_shell_pdn_auth auth_params;
		struct link_shell_pdn_auth *auth_params_ptr = NULL;

		if ((protocol_given &&
		     (username == NULL || password == NULL)) ||
		    ((username != NULL || password != NULL) &&
		     !protocol_given)) {
			mosh_error("When setting authentication, all auth options must be given");
			goto show_usage;
		} else {
			enum pdn_auth method;

			ret = link_shell_pdn_auth_prot_to_pdn_lib_method_map(
				protocol, &method);
			if (ret) {
				mosh_error("Uknown auth protocol %d", protocol);
				goto show_usage;
			}
			auth_params.method = method;
			auth_params.user = username;
			auth_params.password = password;
			if (protocol_given && username != NULL &&
			    password != NULL) {
				auth_params_ptr = &auth_params;
			}
		}
		ret = link_shell_pdn_connect(apn, family, auth_params_ptr);
	} break;
	case LINK_CMD_RAI:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			link_rai_read();
		} else if (link_cmd_args.common_option == LINK_COMMON_ENABLE) {
			link_rai_enable(true);
		} else if (link_cmd_args.common_option == LINK_COMMON_DISABLE) {
			link_rai_enable(false);
		} else {
			goto show_usage;
		}
		break;
	case LINK_CMD_DISCONNECT:
		ret = link_shell_pdn_disconnect(pdn_cid);
		break;
	default:
		mosh_error("Internal error. Unknown link command=%d", link_cmd_args.command);
		ret = -EINVAL;
		break;
	}
	return ret;

show_usage:
	/* Reset getopt for another users: */
	optreset = 1;

	link_shell_print_usage(&link_cmd_args);
	return ret;
}
